reg_rules = [
    {
        title: '必须带端口号的网址(或ip)',
        rule: /^(((ht|f)tps?):\/\/)?[\w-]+(\.[\w-]+)+:\d{0,5}\/?/
    },
    {
        title: '网址(支持端口和"?+参数"和"#+参数)',
        rule: /^(((ht|f)tps?):\/\/)?[\w-]+(\.[\w-]+)+([\w\-.,@?^=%&:/~+#]*[\w\-@?^=%&/~+#])?$/
    },
    {
        title: '统一社会信用代码',
        rule: /^[0-9A-HJ-NPQRTUWXY]{2}\d{6}[0-9A-HJ-NPQRTUWXY]{10}$/
    },

    {
        title: '迅雷链接',
        rule: /^thunderx?:\/\/[a-zA-Z\d]+=$/
    },

    {
        title: 'ed2k链接(宽松匹配)',
        rule: /^ed2k:\/\/\|file\|.+\|\/$/
    },

    {
        title: '磁力链接(宽松匹配)',
        rule: /^magnet:\?xt=urn:btih:[0-9a-fA-F]{40,}.*$/
    },
    {
        title: '子网掩码',
        rule: /^(?:\d{1,2}|1\d\d|2[0-4]\d|25[0-5])(?:\.(?:\d{1,2}|1\d\d|2[0-4]\d|25[0-5])){3}$/
    },
    {
        title: 'linux"文件夹"路径',
        rule: /^\/(\w+\/?)+$/
    },
    {
        title: 'linux"文件"路径',
        rule: /^\/(\w+\/)+\w+\.\w+$/
    },
    {
        title: 'window下"文件夹"路径',
        rule: /^[a-zA-Z]:\\(?:\w+\\?)*$/
    },
    {
        title: 'window下"文件"路径',
        rule: /^[a-zA-Z]:\\(?:\w+\\)*\w+\.\w+$/
    },
    {
        title: 'A股代码',
        rule: /^(s[hz]|S[HZ])(000[\d]{3}|002[\d]{3}|300[\d]{3}|600[\d]{3}|60[\d]{4})$/
    },
    {
        title:
            '大于等于0, 小于等于150, 支持小数位出现5, 如145.5, 用于判断考卷分数',
        rule: /^150$|^(?:\d|[1-9]\d|1[0-4]\d)(?:.5)?$/
    },
    {
        title: 'html注释',
        rule: /^<!--[\s\S]*?-->$/
    },
    {
        title: 'md5格式(32位)',
        rule: /^[a-f0-9]{32}$/
    },
    {
        title: '版本号格式必须为X.Y.Z',
        rule: /^\d+(?:\.\d+){2}$/
    },
    {
        title: '视频链接地址（视频格式可按需增删）',
        rule: /^https?:\/\/.*?(?:swf|avi|flv|mpg|rm|mov|wav|asf|3gp|mkv|rmvb|mp4)$/
    },
    {
        title: '图片链接地址（图片格式可按需增删）',
        rule: /^https?:\/\/.*?(?:gif|png|jpg|jpeg|webp|svg|psd|bmp|tif)$/
    },
    {
        title: '24小时制时间（HH:mm:ss）',
        rule: /^(?:[01]\d|2[0-3]):[0-5]\d:[0-5]\d$/
    },
    {
        title: '12小时制时间（hh:mm:ss）',
        rule: /^(?:1[0-2]|0?[1-9]):[0-5]\d:[0-5]\d$/
    },
    {
        title: 'base64格式',
        rule: /^\s*data:(?:[a-z]+\/[a-z0-9-+.]+(?:;[a-z-]+=[a-z0-9-]+)?)?(?:;base64)?,([a-z0-9!$&',()*+;=\-._~:@/?%\s]*?)\s*$/
    },
    {
        title: '数字/货币金额（支持负数、千分位分隔符）',
        rule: /(?:^[-]?[1-9]\d{0,2}(?:$|(?:,\d{3})*(?:$|(\.\d{1,2}$))))|(?:(?:^[0](\.\d{1,2})?)|(?:^[-][0]\.\d{1,2}))$/
    },
    {
        title: '数字/货币金额 (只支持正数、不支持校验千分位分隔符)',
        rule: /(?:^[1-9]([0-9]+)?(?:\.[0-9]{1,2})?$)|(?:^(?:0){1}$)|(?:^[0-9]\.[0-9](?:[0-9])?$)/
    },
    {
        title:
            '银行卡号（10到30位, 覆盖对公/私账户, 参考[微信支付](https://pay.weixin.qq.com/wiki/doc/api/xiaowei.php?chapter=22_1)）',
        rule: /^[1-9]\d{9,29}$/
    },
    {
        title: '中文姓名',
        rule: /^(?:[\u4e00-\u9fa5·]{2,16})$/
    },
    {
        title: '英文姓名',
        rule: /(^[a-zA-Z]{1}[a-zA-Z\s]{0,20}[a-zA-Z]{1}$)/
    },
    {
        title: '新能源车牌号',
        rule: /[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领 A-Z]{1}[A-HJ-NP-Z]{1}(([0-9]{5}[DF])|([DF][A-HJ-NP-Z0-9][0-9]{4}))$/
    },
    {
        title: '非新能源车牌号',
        rule: /^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领 A-Z]{1}[A-HJ-NP-Z]{1}[A-Z0-9]{4}[A-Z0-9挂学警港澳]{1}$/
    },
    {
        title: '车牌号(新能源+非新能源)',
        rule: /^(?:[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领 A-Z]{1}[A-HJ-NP-Z]{1}(?:(?:[0-9]{5}[DF])|(?:[DF](?:[A-HJ-NP-Z0-9])[0-9]{4})))|(?:[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领 A-Z]{1}[A-Z]{1}[A-HJ-NP-Z0-9]{4}[A-HJ-NP-Z0-9 挂学警港澳]{1})$/
    },
    {
        title: '中国手机号(严谨), 根据工信部2019年最新公布的手机号段',
        rule: /^(?:(?:\+|00)86)?1(?:(?:3[\d])|(?:4[5-7|9])|(?:5[0-3|5-9])|(?:6[5-7])|(?:7[0-8])|(?:8[\d])|(?:9[1|8|9]))\d{8}$/
    },
    {
        title: '中国手机号(宽松), 只要是13,14,15,16,17,18,19开头即可',
        rule: /^(?:(?:\+|00)86)?1[3-9]\d{9}$/
    },
    {
        title:
            '中国手机号(最宽松), 只要是1开头即可, 如果你的手机号是用来接收短信, 优先建议选择这一条',
        rule: /^(?:(?:\+|00)86)?1\d{10}$/
    },
    {
        title: '日期',
        rule: /^\d{4}(-)(1[0-2]|0?\d)\1([0-2]\d|\d|30|31)$/
    },
    {
        title: '邮箱地址(email)',
        rule: /^[a-zA-Z0-9.!#$%&'*+/=?^_`{|}~-]+@[a-zA-Z0-9](?:[a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?(?:\.[a-zA-Z0-9](?:[a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?)*$/
    },
    {
        title: '国内座机电话,如: 0341-86091234',
        rule: /\d{3}-\d{8}|\d{4}-\d{7}/
    },
    {
        title: '一代身份证号(15位数字)',
        rule: /^\d{8}(0\d|10|11|12)([0-2]\d|30|31)\d{3}$/
    },
    {
        title: '二代身份证号(18位数字),最后一位是校验位,可能为数字或字符X',
        rule: /^\d{6}(18|19|20)\d{2}(0\d|10|11|12)([0-2]\d|30|31)\d{3}(\d|X|x)$/
    },
    {
        title: '身份证号, 支持1/2代(15位/18位数字)',
        rule: /(^\d{8}(0\d|10|11|12)([0-2]\d|30|31)\d{3}$)|(^\d{6}(18|19|20)\d{2}(0\d|10|11|12)([0-2]\d|30|31)\d{3}(\d|X|x)$)/
    },
    {
        title: '护照（包含香港、澳门）',
        rule: /(^[EeKkGgDdSsPpHh]\d{8}$)|(^(([Ee][a-fA-F])|([DdSsPp][Ee])|([Kk][Jj])|([Mm][Aa])|(1[45]))\d{7}$)/
    },
    {
        title: '帐号是否合法(字母开头，允许5-16字节，允许字母数字下划线组合',
        rule: /^[a-zA-Z][a-zA-Z0-9_]{4,15}$/
    },
    {
        title: '纯中文/汉字',
        rule: /^(?:[\u3400-\u4DB5\u4E00-\u9FEA\uFA0E\uFA0F\uFA11\uFA13\uFA14\uFA1F\uFA21\uFA23\uFA24\uFA27-\uFA29]|[\uD840-\uD868\uD86A-\uD86C\uD86F-\uD872\uD874-\uD879][\uDC00-\uDFFF]|\uD869[\uDC00-\uDED6\uDF00-\uDFFF]|\uD86D[\uDC00-\uDF34\uDF40-\uDFFF]|\uD86E[\uDC00-\uDC1D\uDC20-\uDFFF]|\uD873[\uDC00-\uDEA1\uDEB0-\uDFFF]|\uD87A[\uDC00-\uDFE0])+$/
    },
    {
        title: '是否小数',
        rule: /^\d+\.\d+$/
    },
    {
        title: '电话(座机)',
        rule: /^0\d{2,3}-\d{7,8}$/
    },
    {
        title: '纯数字',
        rule: /^\d{1,}$/
    },
    {
        title: '是否html标签(宽松匹配)',
        rule: /<(.*)>.*<\/\1>|<(.*) \/>/
    },
    {
        title: '是否qq号格式正确',
        rule: /^[1-9][0-9]{4,10}$/
    },
    {
        title: '是否由数字和字母组成',
        rule: /^[A-Za-z0-9]+$/
    },
    {
        title: '纯英文字母',
        rule: /^[a-zA-Z]+$/
    },
    {
        title: '纯小写英文字母组成',
        rule: /^[a-z]+$/
    },
    {
        title: '纯大写英文字母',
        rule: /^[A-Z]+$/
    },
    {
        title:
            '密码强度正则，最少6位，包括至少1个大写字母，1个小写字母，1个数字，1个特殊字符',
        rule: /^.*(?=.{6,})(?=.*\d)(?=.*[A-Z])(?=.*[a-z])(?=.*[!@#$%^&*? ]).*$/
    },
    {
        title: '用户名正则，4到16位（字母，数字，下划线，减号）',
        rule: /^[a-zA-Z0-9_-]{4,16}$/
    },
    {
        title: 'ip-v4',
        rule: /^(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)$/
    },
    {
        title: 'ip-v6',
        rule: /^((([0-9A-Fa-f]{1,4}:){7}[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){6}:[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){5}:([0-9A-Fa-f]{1,4}:)?[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){4}:([0-9A-Fa-f]{1,4}:){0,2}[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){3}:([0-9A-Fa-f]{1,4}:){0,3}[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){2}:([0-9A-Fa-f]{1,4}:){0,4}[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){6}((\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b)\.){3}(\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b))|(([0-9A-Fa-f]{1,4}:){0,5}:((\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b)\.){3}(\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b))|(::([0-9A-Fa-f]{1,4}:){0,5}((\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b)\.){3}(\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b))|([0-9A-Fa-f]{1,4}::([0-9A-Fa-f]{1,4}:){0,5}[0-9A-Fa-f]{1,4})|(::([0-9A-Fa-f]{1,4}:){0,6}[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){1,7}:))$/
    },
    {
        title: '16进制颜色',
        rule: /^#?([a-fA-F0-9]{6}|[a-fA-F0-9]{3})$/
    },
    {
        title: '微信号，6至20位，以字母开头，字母，数字，减号，下划线',
        rule: /^[a-zA-Z][-_a-zA-Z0-9]{5,19}$/
    },
    {
        title: '中国邮政编码',
        rule: /^(0[1-7]|1[0-356]|2[0-7]|3[0-6]|4[0-7]|5[1-7]|6[1-7]|7[0-5]|8[013-6])\d{4}$/
    },
    {
        title: '只包含中文和数字',
        rule: /^((?:[\u3400-\u4DB5\u4E00-\u9FEA\uFA0E\uFA0F\uFA11\uFA13\uFA14\uFA1F\uFA21\uFA23\uFA24\uFA27-\uFA29]|[\uD840-\uD868\uD86A-\uD86C\uD86F-\uD872\uD874-\uD879][\uDC00-\uDFFF]|\uD869[\uDC00-\uDED6\uDF00-\uDFFF]|\uD86D[\uDC00-\uDF34\uDF40-\uDFFF]|\uD86E[\uDC00-\uDC1D\uDC20-\uDFFF]|\uD873[\uDC00-\uDEA1\uDEB0-\uDFFF]|\uD87A[\uDC00-\uDFE0])|(\d))+$/
    },
    {
        title: '不能包含字母',
        rule: /^[^A-Za-z]*$/
    }
];
